src/test/java/features/WorkOrders/WO_Payloads/updateWO_AddCosts_payload.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:max="http://www.ibm.com/maximo">
   <soapenv:Header />
   <soapenv:Body>
      <UpdateYVWWORKORDER xmlns="http://www.ibm.com/maximo" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
         <YVWWORKORDERSet>
            <WORKORDER action="Change">
               <SITEID>YVW</SITEID>
               <WONUM>#(woNum)</WONUM>
               <max:SERVRECTRANS>
                  <max:ITEMNUM>YVWCOST</max:ITEMNUM>
                  <max:GBSORDERUNIT>$</max:GBSORDERUNIT>
                  <max:UNITCOST>210</max:UNITCOST>
                  <max:TRANSDATE>#(currentTime)</max:TRANSDATE>
                  <max:GLDEBITACCT>
					<max:VALUE>#(costingGLAccount)</max:VALUE>
					<GLCOMP glorder="0">#(costingglorder0)</GLCOMP>
					<GLCOMP glorder="1">#(costingglorder1)</GLCOMP>
					<GLCOMP glorder="2">#(costingglorder2)</GLCOMP>
					<GLCOMP glorder="3">#(costingglorder3)</GLCOMP>
					<GLCOMP glorder="4">#(costingglorder4)</GLCOMP>
					<GLCOMP glorder="5">#(costingglorder5)</GLCOMP>
                  </max:GLDEBITACCT>
                  <max:GBSVENDOR>#(GBSVendor)</max:GBSVENDOR>
                  <max:ENTERBY>#(USERNAME)</max:ENTERBY>
                  <max:ENTERDATE>#(currentTime)</max:ENTERDATE>
               </max:SERVRECTRANS>
            </WORKORDER>
         </YVWWORKORDERSet>
      </UpdateYVWWORKORDER>
   </soapenv:Body>
</soapenv:Envelope>